/* selector = & */
"%b and %b" = "";

/* selector = | */
"%b or %b" = "";

/* selector = + */
"%d + %d" = "";

/* selector = % */
"%d mod %d" = "";

/* selector = * */
"%d × %d" = "";

/* selector = / */
"%d ÷ %d" = "Test Korean";

/* selector = - */
"%d − %d" = "Test Korean 2";

/* selector = list:contains: */
"%ms.list contains %s" = "";

/* selector = computeFunction:of: */
"%ms.mathOperators of %d" = "";

/* selector = transformString:of: */
"%ms.strOperators of %s" = "";

/* selector = position: */
"%ms.xyAxis of position" = "";

/* selector = touchPoint: */
"%ms.xyAxis of touch point" = "";

/* selector = getAttribute:of: */
"%ms._arg_input:objectOrStage.attribute of %m._refresh_.objectOrStage" = "";

/* selector = < */
"%s < %s" = "";

/* selector = <= */
"%s <= %s" = "";

/* selector = = */
"%s = %s" = "";

/* selector = > */
"%s > %s" = "";

/* selector = >= */
"%s >= %s" = "";

/* selector = setObjectNamed:toColor: */
"@_deviceObjectType_ change color of %m.hubDeviceObjects to %c.color" = "";

/* selector = setColor: */
"@_deviceObjectType_ change color to %cs.color" = "";

/* selector = color */
"@_deviceObjectType_ color" = "";

/* selector = flipDevice: */
"@_deviceObjectType_ flip" = "";

/* selector = heading */
"@_deviceObjectType_ heading" = "";

/* selector = land */
"@_deviceObjectType_ land" = "";

/* selector = moveByDirection:forSec: */
"@_deviceObjectType_ move %ms.4wayDirections for %d secs" = "";

/* selector = moveUpDown:forSec: */
"@_deviceObjectType_ move %ms.udDirection for %d secs" = "";

/* selector = moveForSec:atSpeed: */
"@_deviceObjectType_ move for %d secs at %d % speed" = "";

/* selector = readArduinoAnalogPin: */
"@_deviceObjectType_ read analog pin %d.arduinoAnalogPins" = "";

/* selector = readArduinoDigitalPin: */
"@_deviceObjectType_ read digital pin %d.arduinoPins" = "";

/* selector = heading: */
"@_deviceObjectType_ set heading to %d degrees" = "";

/* selector = maximumHeight: */
"@_deviceObjectType_ set maximum height to %d m" = "";

/* selector = setArduinoPin:toMode: */
"@_deviceObjectType_ set pin %d.arduinoPins to mode %m.arduinoPinMode" = "";

/* selector = speed: */
"@_deviceObjectType_ set speed to %d %" = "";

/* selector = speed */
"@_deviceObjectType_ speed" = "";

/* selector = spinTimes:forSec: */
"@_deviceObjectType_ spin %d times for %d seconds" = "";

/* selector = startMoveAtSpeed: */
"@_deviceObjectType_ start moving at %d % speed" = "";

/* selector = startJumping */
"@_deviceObjectType_ start to jump" = "";

/* selector = stopMove */
"@_deviceObjectType_ stop moving" = "";

/* selector = takePhoto */
"@_deviceObjectType_ take a photo" = "";

/* selector = takeOff */
"@_deviceObjectType_ take off" = "";

/* selector = powerSwitch:name: */
"@_deviceObjectType_ turn %m.powerSwitch %m.hubDeviceObjects" = "";

/* selector = turn:byDegree: */
"@_deviceObjectType_ turn %ms.rlDirection by %d degrees" = "";

/* selector = writeValue:toArduinoAnalogPin: */
"@_deviceObjectType_ write %d to analog pin %d.arduinoAnalogPins" = "";

/* selector = writeValue:toArduinoDigitalPin: */
"@_deviceObjectType_ write %d.digitalPinValues to digital pin %d.arduinoPins" = "";

/* selector = accelerometer:of: */
"accelerometer %ms.xyzAxis of %ms.accelerometerDevices" = "";

/* selector = append:toList: */
"add %s to %ms.list" = "";

/* selector = answer */
"answer of last asked question" = "";

/* selector = ask: */
"ask %s and wait" = "";

/* selector = attitude:of: */
"attitude %ms.gyroDirections of %ms.attitudeDevices" = "";

/* selector = broadcast: */
"broadcast %s.broadcast" = "";

/* selector = broadcastAndWait: */
"broadcast %s.broadcast and wait" = "";

/* selector = changeGraphicEffect:by: */
"change %ms.effect effect by %d" = "";

/* selector = changeVar:by: */
"change %ms.variable by %d" = "";

/* selector = changePositionOf:by: */
"change %ms.xyAxis by %d" = "";

/* selector = changeScaleBy: */
"change scale by %d %" = "";

/* selector = changeVolumeBy: */
"change volume by %d" = "";

/* selector = clearGraphicEffects */
"clear graphic effects" = "";

/* selector = color:sees: */
"color %c is touching %c?" = "";

/* selector = createCloneOf: */
"create clone of %m.character" = "";

/* selector = timeAndDate: */
"current %ms.timeAndDate" = "";

/* selector = timestamp */
"days since 2000" = "";

/* selector = procDef */
"define" = "";

/* selector = deleteLine:ofList: */
"delete %ds.listDeleteItem of %ms.list" = "";

/* selector = deleteClone */
"delete this clone" = "";

/* selector = direction */
"direction" = "";

/* selector = distanceTo: */
"distance to %m.characterOrTouchPoint" = "";

/* selector = touchingDown */
"finger touching down?" = "";

/* selector = flip: */
"flip %ms.hvDirection" = "";

/* selector = foreverDo: */
"forever" = "";

/* selector = temperatureOf: */
"get temperature from %ms.thermometerDevices" = "";

/* selector = glideSecs:toX:y: */
"glide %d secs to x:%d y:%d" = "";

/* selector = goBackByLayers: */
"go back %d layers" = "";

/* selector = gotoCharacterOrTouchPoint: */
"go to %m.characterOrTouchPoint" = "";

/* selector = comeToFront */
"go to front" = "";

/* selector = gotoX:y: */
"go to x:%d y:%d" = "";

/* selector = gyroscope:of: */
"gyroscope %ms.xyzAxis of %ms.gyroDevices" = "";

/* selector = hide */
"hide" = "";

/* selector = isClone */
"I am a clone" = "";

/* selector = if:do: */
"if %b then" = "";

/* selector = ? */
"if %b then %s else %s" = "";

/* selector = if:do:else: */
"if %b then | else" = "";

/* selector = bounceOffEdge */
"if on edge, bounce" = "";

/* selector = insert:at:ofList: */
"insert %s at %ds.listItem of %ms.list" = "";

/* selector = getLine:ofList: */
"item %ds.listItem of %ms.list" = "";

/* selector = concatenate:with: */
"join %s %s" = "";

/* selector = countOfList: */
"length of %ms.list" = "";

/* selector = stringLength: */
"length of %s" = "";

/* selector = letter:of: */
"letter %d of %s" = "";

/* selector = soundLevel */
"loudness" = "";

/* selector = forward: */
"move %d steps" = "";

/* selector = forward:atHeading: */
"move %d steps at %d.direction degrees" = "";

/* selector = not */
"not %b" = "";

/* selector = randomFrom:to: */
"pick random from %d to %d" = "";

/* selector = playSound: */
"play sound %m.sound" = "";

/* selector = playSoundAndWait: */
"play sound %m.sound until done" = "";

/* selector = pointTowards: */
"point towards %m.characterOrTouchPoint" = "";

/* selector = repeat:do: */
"repeat %d times" = "";

/* selector = repeatUntil:do: */
"repeat until %b" = "";

/* selector = setLine:ofList:to: */
"replace item %ds.listItem of %ms.list with %s" = "";

/* selector = timerReset */
"reset timer" = "";

/* selector = rounded */
"round %d" = "";

/* selector = say: */
"say %s" = "";

/* selector = scale: */
"scale of %ms.whDirection2" = "";

/* selector = setGraphicEffect:to: */
"set %ms.effect effect to %d" = "";

/* selector = setVar:to: */
"set %ms.variable to %s" = "";

/* selector = setPositionOf:to: */
"set %ms.xyAxis to %d" = "";

/* selector = direction: */
"set direction to %d.direction degrees" = "";

/* selector = setLooks: */
"set looks to %m.looks" = "";

/* selector = setScaleOf:to: */
"set scale of %ms.whDirection2 to %d %" = "";

/* selector = setVolumeTo: */
"set volume to %d%" = "";

/* selector = show */
"show" = "";

/* selector = startPlayLooks: */
"start to play animation %m.looks" = "";

/* selector = stopScripts: */
"stop %ms.stop" = "";

/* selector = stopAllSounds */
"stop all sounds" = "";

/* selector = think: */
"think %s" = "";

/* selector = timer */
"timer" = "";

/* selector = touching: */
"touching %m.touching ?" = "";

/* selector = touchingColor: */
"touching color %c?" = "";

/* selector = visible */
"visible" = "";

/* selector = volume */
"volume" = "";

/* selector = wait: */
"wait %d secs" = "";

/* selector = waitUntil: */
"wait until %b" = "";

/* selector = whenCollisionDetected: */
"When %ms.collisionDevices collides" = "";

/* selector = whenSensor:greaterThan: */
"When %ms.triggerSensor > %d" = "";

/* selector = whenReceive: */
"When I receive %ss.broadcast" = "";

/* selector = whenCloned */
"When I start as a clone" = "";

/* selector = whenStartPlay */
"When starting to play" = "";

/* selector = whenNodeTouched: */
"When this character %ms.nodeTouchEvent" = "";

/* selector = contentsOfList: */
"_list_name_" = "";

/* selector = readVariable: */
"_variable_name_" = "";

